content/posts/blog/jekyll/.jekyll.org
#+STARTUP: content
#+OPTIONS: \n:t
#+TITLE:	Jekyll
#+EXPORT_FILE_NAME: jekyll
#+AUTHOR:	Shawn Dennis Lin
#+EMAIL:	ShawnDennisLin@gmail.com
#+DATE:	[2020-11-18 Wed]

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

#+SEQ_TODO: TODO DRAFT DONE
#+PROPERTY: header-args :eval no

#+HUGO_BASE_DIR: ~/shdennlin.github.io
#+HUGO_SECTION: /posts/blog/jekyll

#+hugo_menu: :menu sidebar :name Jkeyll :identifier blog-jekyll :parent blog :weight auto
#+HUGO_CATEGORIES: Blog
#+HUGO_TAGS: jekyll
#+HUGO_DRAFT: false
#+hugo_custom_front_matter: :hero /posts/blog/jekyll/images/jekyll.png

This is my note for Jkeyll

#+HUGO: more

** Install
To see [[https://jekyllrb.com/][Official Website]](English) or [[http://jekyllcn.com/][Official Website]](Chinese)

** Tutorials
- [[https://segmentfault.com/a/1190000008313904][Org-Mode和Jekyll寫部落格]](segmentfault)
- [[https://jsuper.github.io/emacs/using-org-mode-to-write-jekyll-post.html][使用org-mode撰写jekyll博客]]
- [[https://www.youtube.com/watch?v=Zt_QzSbyDcw&list=PLK2w-tGRdrj7vzX7Y-GqKPb2QPrHCYZY1][Jekyll 博客系列]](youtube)
- [[https://github.com/bitjockey42/spacemacs-jekyll][Spacemacs-jekyll-layer]]

** Command
 
** Plugins
you can find *jekyll's plugins & extensions* below:
- [[https://jekyllcn.com/docs/plugins/][jekyll official website]]
- [[https://planetjekyll.github.io/plugins/top][planet jekyll's plugins & extensions]]
- [[http://www.jekyll-plugins.com/][jekyll-plugins]] 

These are the plugins I recommend:
| name     | Github   | Ref                         |
|----------+----------+-----------------------------|
| paginate | [[https://github.com/jekyll/jekyll-paginate][paginate]] | [[https://www.twblogs.net/a/5c5304e6bd9eee3d4989b377][[Github Pages] 徒手實現分頁]] |
|          |          |                             |
|          |          |                             |

** Theme
You can find the theme from [[http://jekyllthemes.org/][jekyllthemes.org]], these is my recommended theme:
1. [[http://jekyllthemes.org/themes/wiki-blog/][Wiki blog]]
2. [[http://jekyllthemes.org/themes/cool-concise-high-end/][Cool Concise High-end]]
 
