content/posts/blog/jekyll/jekyll.md
+++
title = "Jekyll"
author = ["Shawn Dennis Lin"]
date = 2020-11-18T00:00:00+08:00
lastmod = 2020-11-30T21:49:24+08:00
tags = ["jekyll"]
categories = ["Blog"]
draft = false
hero = "/posts/blog/jekyll/images/jekyll.png"
[menu.sidebar]
  parent = "blog"
  weight = "auto"
  identifier = "blog-jekyll"
  name = "Jkeyll"
+++

This is my note for Jkeyll  

<!--more-->


## Install {#install}

To see [Official Website](https://jekyllrb.com/)(English) or [Official Website](http://jekyllcn.com/)(Chinese)  


## Tutorials {#tutorials}

-   [Org-Mode和Jekyll寫部落格](https://segmentfault.com/a/1190000008313904)(segmentfault)
-   [使用org-mode撰写jekyll博客](https://jsuper.github.io/emacs/using-org-mode-to-write-jekyll-post.html)
-   [Jekyll 博客系列](https://www.youtube.com/watch?v=Zt%5FQzSbyDcw&list=PLK2w-tGRdrj7vzX7Y-GqKPb2QPrHCYZY1)(youtube)
-   [Spacemacs-jekyll-layer](https://github.com/bitjockey42/spacemacs-jekyll)


## Command {#command}


## Plugins {#plugins}

you can find **jekyll's plugins & extensions** below:  

-   [jekyll official website](https://jekyllcn.com/docs/plugins/)
-   [planet jekyll's plugins & extensions](https://planetjekyll.github.io/plugins/top)
-   [jekyll-plugins](http://www.jekyll-plugins.com/)

These are the plugins I recommend:  

| name     | Github                                                | Ref                                                                         |
|----------|-------------------------------------------------------|-----------------------------------------------------------------------------|
| paginate | [paginate](https://github.com/jekyll/jekyll-paginate) | [[Github Pages] 徒手實現分頁](https://www.twblogs.net/a/5c5304e6bd9eee3d4989b377) |
|          |                                                       |                                                                             |
|          |                                                       |                                                                             |


## Theme {#theme}

You can find the theme from [jekyllthemes.org](http://jekyllthemes.org/), these is my recommended theme:  

1.  [Wiki blog](http://jekyllthemes.org/themes/wiki-blog/)
2.  [Cool Concise High-end](http://jekyllthemes.org/themes/cool-concise-high-end/)
